Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR30_DFP/2.0.32/atdf/ATSAMR30G18A.atdf
<?xml version="1.0"?>
<!--
 Copyright (c) 2018 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2020-07-21T07:21:59Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="SAMR30G18A-MU" mhc:ordercode="ATSAMR30G18A-MU" package="QFN48" pinout="SAMR30E" speedmax="48000000" tempmin="-40" tempmax="85" vccmin="1.62" vccmax="3.63"/>
  </variants>
  <devices>
    <device name="ATSAMR30G18A" architecture="CORTEX-M0PLUS" family="SAMR" series="SAMR30">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x40000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="CAL" start="0x00800000" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="LOCKBIT" start="0x00802000" size="0x4" type="fuses" rw="R"/>
          <memory-segment name="OTP1" start="0x00806000" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="OTP2" start="0x00806008" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="OTP3" start="0x00806010" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="OTP4" start="0x00806018" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="OTP5" start="0x00806020" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="TEMP_LOG" start="0x00806030" size="0x8" type="fuses" rw="R"/>
          <memory-segment name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/>
          <memory-segment name="RWW" start="0x00400000" size="0x2000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x8000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="LPRAM" start="0x30000000" size="0x2000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HPB0" start="0x40000000" size="0x4000" type="io" rw="RW"/>
          <memory-segment name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="HPB2" start="0x42000000" size="0x8000" type="io" rw="RW"/>
          <memory-segment name="HPB3" start="0x43000000" size="0x2000" type="io" rw="RW"/>
          <memory-segment name="HPB4" start="0x44000000" size="0x1000" type="io" rw="RW"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
          <memory-segment name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW"/>
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x20000000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="NUM_IRQ" value="29" caption="Number of interrupt request lines"/>
        <param name="__CM0PLUS_REV" value="0x0001" caption="Cortex-M0+ Core Revision"/>
        <param name="__MPU_PRESENT" value="0" caption="MPU present or not"/>
        <param name="__NVIC_PRIO_BITS" value="2" caption="Number of Bits used for Priority Levels"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
        <param name="__DEVICE_IS_SAM" value="1"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2245" version="1.0.1">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x43001000"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PA04"/>
              <signal group="AIN" index="1" function="B" pad="PA05"/>
              <signal group="AIN" index="2" function="B" pad="PA06"/>
              <signal group="AIN" index="3" function="B" pad="PA07"/>
              <signal group="CMP" index="0" function="H" pad="PA12"/>
              <signal group="CMP" index="0" function="H" pad="PA18"/>
              <signal group="CMP" index="1" function="H" pad="PA13"/>
              <signal group="CMP" index="1" function="H" pad="PA19"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="31" caption="Index of Generic Clock"/>
              <param name="NUM_CMP" value="2" caption="Number of comparators"/>
              <param name="PAIRS" value="1" caption="Number of pairs of comparators"/>
              <param name="INSTANCE_ID" value="100"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="U2247" version="1.1.1">
          <instance name="ADC">
            <register-group name="ADC" name-in-module="ADC" address-space="base" offset="0x43000C00"/>
            <signals>
              <signal group="AIN" index="2" function="B" pad="PB08"/>
              <signal group="AIN" index="3" function="B" pad="PB09"/>
              <signal group="AIN" index="4" function="B" pad="PA04"/>
              <signal group="AIN" index="5" function="B" pad="PA05"/>
              <signal group="AIN" index="6" function="B" pad="PA06"/>
              <signal group="AIN" index="7" function="B" pad="PA07"/>
              <signal group="AIN" index="8" function="B" pad="PB00"/>
              <signal group="AIN" index="10" function="B" pad="PB02"/>
              <signal group="AIN" index="11" function="B" pad="PB03"/>
              <signal group="AIN" index="16" function="B" pad="PA08"/>
              <signal group="AIN" index="17" function="B" pad="PA09"/>
              <signal group="AIN" index="18" function="B" pad="PA10"/>
              <signal group="AIN" index="19" function="B" pad="PA11"/>
              <signal group="VREFP" function="B" pad="PA04"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="37" caption="index of DMA RESRDY trigger"/>
              <param name="EXTCHANNEL_MSB" value="19" caption="Number of external channels"/>
              <param name="GCLK_ID" value="30" caption="index of Generic Clock"/>
              <param name="RESULT_BITS" value="16" caption="Size of RESULT.RESULT bitfield"/>
              <param name="RESULT_MSB" value="15" caption="Size of Result"/>
              <param name="INSTANCE_ID" value="99"/>
              <param name="LOAD_CALIB" value="1" caption="CALIB register to be loaded from NVM"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="1.0.1">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x43001C00"/>
            <signals>
              <signal group="IN" index="0" function="I" pad="PA04"/>
              <signal group="IN" index="0" function="I" pad="PA16"/>
              <signal group="IN" index="0" function="I" pad="PB22"/>
              <signal group="IN" index="1" function="I" pad="PA05"/>
              <signal group="IN" index="1" function="I" pad="PA17"/>
              <signal group="IN" index="1" function="I" pad="PB00"/>
              <signal group="IN" index="2" function="I" pad="PA06"/>
              <signal group="IN" index="2" function="I" pad="PA18"/>
              <signal group="IN" index="3" function="I" pad="PA08"/>
              <signal group="IN" index="3" function="I" pad="PA30"/>
              <signal group="IN" index="4" function="I" pad="PA09"/>
              <signal group="IN" index="5" function="I" pad="PA10"/>
              <signal group="IN" index="6" function="I" pad="PA22"/>
              <signal group="IN" index="7" function="I" pad="PA23"/>
              <signal group="IN" index="8" function="I" pad="PA24"/>
              <signal group="IN" index="8" function="I" pad="PB08"/>
              <signal group="IN" index="9" function="I" pad="PB14"/>
              <signal group="IN" index="10" function="I" pad="PB15"/>
              <signal group="IN" index="11" function="I" pad="PB16"/>
              <signal group="OUT" index="0" function="I" pad="PA07"/>
              <signal group="OUT" index="0" function="I" pad="PA19"/>
              <signal group="OUT" index="0" function="I" pad="PB02"/>
              <signal group="OUT" index="0" function="I" pad="PB23"/>
              <signal group="OUT" index="1" function="I" pad="PA11"/>
              <signal group="OUT" index="1" function="I" pad="PA31"/>
              <signal group="OUT" index="2" function="I" pad="PA25"/>
              <signal group="OUT" index="2" function="I" pad="PB09"/>
              <signal group="OUT" index="3" function="I" pad="PB17"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="34" caption="GCLK index for CCL"/>
              <param name="IO_NUM" value="12" caption="Numer of input pins"/>
              <param name="LUT_NUM" value="4" caption="Number of LUT in a CCL"/>
              <param name="SEQ_NUM" value="2" caption="Number of SEQ in a CCL"/>
              <param name="INSTANCE_ID" value="103"/>
            </parameters>
          </instance>
        </module>
