Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR30_DFP/2.0.32/atdf/ATSAMR30G18A.atdf
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x43000800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA18"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="1" function="E" pad="PA19"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="34" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="35" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="36" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="29"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="INSTANCE_ID" value="98"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="3.0.0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="0" function="E" pad="PB30"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
              <signal group="WO" index="1" function="E" pad="PB31"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="2" function="F" pad="PA18"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="3" function="F" pad="PA19"/>
              <signal group="WO" index="4" function="F" pad="PA22"/>
              <signal group="WO" index="4" function="F" pad="PB16"/>
              <signal group="WO" index="4" function="F" pad="PA14"/>
              <signal group="WO" index="5" function="F" pad="PA15"/>
              <signal group="WO" index="5" function="F" pad="PA23"/>
              <signal group="WO" index="5" function="F" pad="PB17"/>
              <signal group="WO" index="6" function="F" pad="PA12"/>
              <signal group="WO" index="6" function="F" pad="PA16"/>
              <signal group="WO" index="6" function="F" pad="PA20"/>
              <signal group="WO" index="7" function="F" pad="PA13"/>
              <signal group="WO" index="7" function="F" pad="PA17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="11" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="12" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="13" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DMAC_ID_MC2" value="14" caption="Indexes of DMA Match/Compare 2 trigger"/>
              <param name="DMAC_ID_MC3" value="15" caption="Indexes of DMA Match/Compare 3 trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="31" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="TYPE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
              <signal group="WO" index="2" function="F" pad="PA08"/>
              <signal group="WO" index="2" function="F" pad="PA24"/>
              <signal group="WO" index="2" function="F" pad="PB30"/>
              <signal group="WO" index="3" function="F" pad="PA09"/>
              <signal group="WO" index="3" function="F" pad="PA25"/>
              <signal group="WO" index="3" function="F" pad="PB31"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="16" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="17" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="18" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="24" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="25" caption="Index of Generic Clock"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="4" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="TYPE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
