Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR30_DFP/2.0.32/atdf/ATSAMR30G18A.atdf
        <register name="WRCONFIG" offset="0x28" rw="W" size="4" access-size="4" initval="0x00000000" caption="Write Configuration">
          <bitfield name="PINMASK" caption="Pin Mask for Multiple Pin Configuration" mask="0xFFFF"/>
          <bitfield name="PMUXEN" caption="Select Peripheral Multiplexer" mask="0x10000"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x20000"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x40000"/>
          <bitfield name="DRVSTR" caption="Output Driver Strength Selection" mask="0x400000"/>
          <bitfield name="PMUX" caption="Peripheral Multiplexing Template" mask="0xF000000"/>
          <bitfield name="WRPMUX" caption="Write PMUX Registers" mask="0x10000000"/>
          <bitfield name="WRPINCFG" caption="Write PINCFG Registers" mask="0x40000000"/>
          <bitfield name="HWSEL" caption="Half-Word Select" mask="0x80000000"/>
        </register>
        <register name="EVCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Event Input Control">
          <bitfield name="PID0" caption="Port Event Pin Identifier 0" mask="0x1F"/>
          <bitfield name="EVACT0" caption="Port Event Action 0" mask="0x60"/>
          <bitfield name="PORTEI0" caption="Port Event Enable Input 0" mask="0x80"/>
          <bitfield name="PID1" caption="Port Event Pin Identifier 1" mask="0x1F00"/>
          <bitfield name="EVACT1" caption="Port Event Action 1" mask="0x6000"/>
          <bitfield name="PORTEI1" caption="Port Event Enable Input 1" mask="0x8000"/>
          <bitfield name="PID2" caption="Port Event Pin Identifier 2" mask="0x1F0000"/>
          <bitfield name="EVACT2" caption="Port Event Action 2" mask="0x600000"/>
          <bitfield name="PORTEI2" caption="Port Event Enable Input 2" mask="0x800000"/>
          <bitfield name="PID3" caption="Port Event Pin Identifier 3" mask="0x1F000000"/>
          <bitfield name="EVACT3" caption="Port Event Action 3" mask="0x60000000"/>
          <bitfield name="PORTEI3" caption="Port Event Enable Input 3" mask="0x80000000"/>
        </register>
        <register name="PMUX" offset="0x30" rw="RW" size="1" count="16" initval="0x00" caption="Peripheral Multiplexing n">
          <bitfield name="PMUXE" caption="Peripheral Multiplexing for Even-Numbered Pin" mask="0xF"/>
          <bitfield name="PMUXO" caption="Peripheral Multiplexing for Odd-Numbered Pin" mask="0xF0"/>
        </register>
        <register name="PINCFG" offset="0x40" rw="RW" size="1" count="32" initval="0x00" caption="Pin Configuration n">
          <bitfield name="PMUXEN" caption="Select Peripheral Multiplexer" mask="0x1"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x2"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x4"/>
          <bitfield name="DRVSTR" caption="Output Driver Strength Selection" mask="0x40"/>
        </register>
      </register-group>
      <register-group name="PORT" caption="Port Module">
        <register-group name="GROUP" name-in-module="GROUP" offset="0x00" size="0x80" count="3"/>
      </register-group>
    </module>
    <module name="PTC" id="U2215" version="2.1.0" caption="Peripheral Touch Controller">
      <register-group name="PTC" caption="Peripheral Touch Controller"/>
    </module>
    <module name="RFCTRL" id="U2233" version="1.0.0" caption="RF212B control module">
      <register-group name="RFCTRL" caption="RF212B control module">
        <register name="FECFG" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Front-end control bus configuration">
          <bitfield name="F0CFG" caption="Front-end control signal 0 configuration" mask="0x3"/>
          <bitfield name="F1CFG" caption="Front-end control signal 1 configuration" mask="0xC"/>
          <bitfield name="F2CFG" caption="Front-end control signal 2 configuration" mask="0x30"/>
          <bitfield name="F3CFG" caption="Front-end control signal 3 configuration" mask="0xC0"/>
          <bitfield name="F4CFG" caption="Front-end control signal 4 configuration" mask="0x300"/>
          <bitfield name="F5CFG" caption="Front-end control signal 5 configuration" mask="0xC00"/>
        </register>
      </register-group>
    </module>
    <module name="RSTC" id="U2239" version="1.1.0" caption="Reset Controller">
      <register-group name="RSTC" caption="Reset Controller">
        <register name="RCAUSE" offset="0x0" rw="R" size="1" caption="Reset Cause">
          <bitfield name="POR" caption="Power On Reset" mask="0x1"/>
          <bitfield name="BOD12" caption="Brown Out 12 Detector Reset" mask="0x2"/>
          <bitfield name="BOD33" caption="Brown Out 33 Detector Reset" mask="0x4"/>
          <bitfield name="EXT" caption="External Reset" mask="0x10"/>
          <bitfield name="WDT" caption="Watchdog Reset" mask="0x20"/>
          <bitfield name="SYST" caption="System Reset Request" mask="0x40"/>
          <bitfield name="BACKUP" caption="Backup Reset" mask="0x80"/>
        </register>
        <register name="BKUPEXIT" offset="0x2" rw="R" size="1" caption="Backup Exit Source">
          <bitfield name="EXTWAKE" caption="External Wakeup" mask="0x1"/>
          <bitfield name="RTC" caption="Real Timer Counter Interrupt" mask="0x2"/>
          <bitfield name="BBPS" caption="Battery Backup Power Switch" mask="0x4"/>
        </register>
        <register name="WKDBCONF" offset="0x4" rw="RW" size="1" initval="0x00" caption="Wakeup Debounce Configuration">
          <bitfield name="WKDBCNT" caption="Wakeup Debounce Counter" mask="0x1F" values="RSTC_WKDBCONF__WKDBCNT"/>
        </register>
        <register name="WKPOL" offset="0x8" rw="RW" size="2" initval="0x0000" caption="Wakeup Polarity">
          <bitfield name="WKPOL" caption="Wakeup Polarity" mask="0xFF"/>
        </register>
        <register name="WKEN" offset="0xC" rw="RW" size="2" initval="0x0000" caption="Wakeup Enable">
          <bitfield name="WKEN" caption="Wakeup Enable" mask="0xFF"/>
        </register>
        <register name="WKCAUSE" offset="0x10" rw="RW" size="2" initval="0x0000" caption="Wakeup Cause">
          <bitfield name="WKCAUSE" caption="Wakeup Cause" mask="0xFFFF"/>
        </register>
      </register-group>
      <value-group name="RSTC_WKDBCONF__WKDBCNT">
        <value name="OFF" caption="No debouncing.Input pin is low or high level sensitive depending on its WKPOLx bit." value="0x00"/>
        <value name="2CK32" caption="Input pin shall be active for at least two 32kHz clock period." value="0x01"/>
        <value name="3CK32" caption="Input pin shall be active for at least three 32kHz clock period." value="0x02"/>
        <value name="32CK32" caption="Input pin shall be active for at least 32 32kHz clock period." value="0x03"/>
        <value name="512CK32" caption="Input pin shall be active for at least 512 32kHz clock period." value="0x04"/>
        <value name="4096CK32" caption="Input pin shall be active for at least 4096 32kHz clock period." value="0x05"/>
        <value name="32768CK32" caption="Input pin shall be active for at least 32768 32kHz clock period." value="0x06"/>
      </value-group>
    </module>
