Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR30_DFP/2.0.32/atdf/ATSAMR30G18A.atdf
        <register modes="HOST" name="HSOFC" offset="0xA" rw="RW" size="1" initval="0x00" caption="HOST Host Start Of Frame Control">
          <bitfield name="FLENC" caption="Frame Length Control" mask="0xF"/>
          <bitfield name="FLENCE" caption="Frame Length Control Enable" mask="0x80"/>
        </register>
        <register modes="DEVICE" name="STATUS" offset="0xC" rw="R" size="1" initval="0x40" caption="DEVICE Status">
          <bitfield name="SPEED" caption="Speed Status" mask="0xC" values="USB_DEVICE_STATUS__SPEED"/>
          <bitfield name="LINESTATE" caption="USB Line State Status" mask="0xC0" values="USB_DEVICE_STATUS__LINESTATE"/>
        </register>
        <register modes="HOST" name="STATUS" offset="0xC" rw="RW" size="1" initval="0x00" caption="HOST Status">
          <bitfield name="SPEED" caption="Speed Status" mask="0xC"/>
          <bitfield name="LINESTATE" caption="USB Line State Status" mask="0xC0"/>
        </register>
        <register name="FSMSTATUS" offset="0xD" rw="R" size="1" initval="0x01" caption="Finite State Machine Status">
          <bitfield name="FSMSTATE" caption="Fine State Machine Status" mask="0x7F" values="USB_FSMSTATUS__FSMSTATE"/>
        </register>
        <register modes="DEVICE" name="FNUM" offset="0x10" rw="R" size="2" initval="0x0000" caption="DEVICE Device Frame Number">
          <bitfield name="MFNUM" caption="Micro Frame Number" mask="0x7"/>
          <bitfield name="FNUM" caption="Frame Number" mask="0x3FF8"/>
          <bitfield name="FNCERR" caption="Frame Number CRC Error" mask="0x8000"/>
        </register>
        <register modes="HOST" name="FNUM" offset="0x10" rw="RW" size="2" initval="0x0000" caption="HOST Host Frame Number">
          <bitfield name="MFNUM" caption="Micro Frame Number" mask="0x7"/>
          <bitfield name="FNUM" caption="Frame Number" mask="0x3FF8"/>
        </register>
        <register modes="HOST" name="FLENHIGH" offset="0x12" rw="R" size="1" initval="0x00" caption="HOST Host Frame Length">
          <bitfield name="FLENHIGH" caption="Frame Length" mask="0xFF"/>
        </register>
        <register modes="DEVICE" name="INTENCLR" offset="0x14" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="DEVICE Device Interrupt Enable Clear">
          <bitfield name="SUSPEND" caption="Suspend Interrupt Enable" mask="0x1"/>
          <bitfield name="MSOF" caption="Micro Start of Frame Interrupt Enable in High Speed Mode" mask="0x2"/>
          <bitfield name="SOF" caption="Start Of Frame Interrupt Enable" mask="0x4"/>
          <bitfield name="EORST" caption="End of Reset Interrupt Enable" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up Interrupt Enable" mask="0x10"/>
          <bitfield name="EORSM" caption="End Of Resume Interrupt Enable" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access Interrupt Enable" mask="0x80"/>
          <bitfield name="LPMNYET" caption="Link Power Management Not Yet Interrupt Enable" mask="0x100"/>
          <bitfield name="LPMSUSP" caption="Link Power Management Suspend Interrupt Enable" mask="0x200"/>
        </register>
        <register modes="HOST" name="INTENCLR" offset="0x14" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="HOST Host Interrupt Enable Clear">
          <bitfield name="HSOF" caption="Host Start Of Frame Interrupt Disable" mask="0x4"/>
          <bitfield name="RST" caption="BUS Reset Interrupt Disable" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up Interrupt Disable" mask="0x10"/>
          <bitfield name="DNRSM" caption="DownStream to Device Interrupt Disable" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume from Device Interrupt Disable" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access Interrupt Disable" mask="0x80"/>
          <bitfield name="DCONN" caption="Device Connection Interrupt Disable" mask="0x100"/>
          <bitfield name="DDISC" caption="Device Disconnection Interrupt Disable" mask="0x200"/>
        </register>
        <register modes="DEVICE" name="INTENSET" offset="0x18" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="DEVICE Device Interrupt Enable Set">
          <bitfield name="SUSPEND" caption="Suspend Interrupt Enable" mask="0x1"/>
          <bitfield name="MSOF" caption="Micro Start of Frame Interrupt Enable in High Speed Mode" mask="0x2"/>
          <bitfield name="SOF" caption="Start Of Frame Interrupt Enable" mask="0x4"/>
          <bitfield name="EORST" caption="End of Reset Interrupt Enable" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up Interrupt Enable" mask="0x10"/>
          <bitfield name="EORSM" caption="End Of Resume Interrupt Enable" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access Interrupt Enable" mask="0x80"/>
          <bitfield name="LPMNYET" caption="Link Power Management Not Yet Interrupt Enable" mask="0x100"/>
          <bitfield name="LPMSUSP" caption="Link Power Management Suspend Interrupt Enable" mask="0x200"/>
        </register>
        <register modes="HOST" name="INTENSET" offset="0x18" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="HOST Host Interrupt Enable Set">
          <bitfield name="HSOF" caption="Host Start Of Frame Interrupt Enable" mask="0x4"/>
          <bitfield name="RST" caption="Bus Reset Interrupt Enable" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up Interrupt Enable" mask="0x10"/>
          <bitfield name="DNRSM" caption="DownStream to the Device Interrupt Enable" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume fromthe device Interrupt Enable" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access Interrupt Enable" mask="0x80"/>
          <bitfield name="DCONN" caption="Link Power Management Interrupt Enable" mask="0x100"/>
          <bitfield name="DDISC" caption="Device Disconnection Interrupt Enable" mask="0x200"/>
        </register>
        <register modes="DEVICE" name="INTFLAG" offset="0x1C" rw="RW" size="2" atomic-op="clear:INTFLAG" initval="0x0000" caption="DEVICE Device Interrupt Flag">
          <bitfield name="SUSPEND" caption="Suspend" mask="0x1"/>
          <bitfield name="MSOF" caption="Micro Start of Frame in High Speed Mode" mask="0x2"/>
          <bitfield name="SOF" caption="Start Of Frame" mask="0x4"/>
          <bitfield name="EORST" caption="End of Reset" mask="0x8"/>
          <bitfield name="WAKEUP" caption="Wake Up" mask="0x10"/>
          <bitfield name="EORSM" caption="End Of Resume" mask="0x20"/>
          <bitfield name="UPRSM" caption="Upstream Resume" mask="0x40"/>
          <bitfield name="RAMACER" caption="Ram Access" mask="0x80"/>
          <bitfield name="LPMNYET" caption="Link Power Management Not Yet" mask="0x100"/>
          <bitfield name="LPMSUSP" caption="Link Power Management Suspend" mask="0x200"/>
        </register>
